<?php
if (!defined('BASE_PATH')) exit('Access Denied!');
//渠道分组列表
$channel['CHANNEL_GROUP_LIST'] = array(
		1 =>'百度', 2 =>'华为',3 =>'小米',4 =>'联想',5 =>'阿里云', 6 =>'oppo',7 =>'金立',8 =>'360',9 =>'酷派',10 =>'豌豆荚',
		11 =>'安智',12 =>'魅族',13 =>'4399',14 =>'UC',15 =>'三星', 16=>'2345',17=>'酷狗',18=>'力天保利',19=>'卓游',20=>'美图',
		21=>'掌星', 22=>'掌星立意',23=>'连尚',24=>'TCL',25=>'应用汇',26=>'拇指玩',27=>'掌越',28=>'云雀', 29=>'走马',30=>'邻动',
		31=>'聚乐',32=>'锤子',33=>'7k',34=>'努比亚',35=>'酷比', 36=>'安锋网', 37=>'益玩',38=>'乐泾达',39=>'酷我',40=>'3533',
		41=>'宝软',42=>'福建风灵',43=>'迅瑞',44=>'游戏狗',45=>'移卓', 46=>'翱海科技', 47=>'腾讯',48=>' 西西软件',49=>'vivo',
		50=>'PPTV',51=>'乐视',52=>'青柠',53=>'搜狗',54=>'搜狐',55=>'新浪',56=>'优酷',57=>'其它',58=>'金立奥软'
);
return $channel;