<?php
if (!defined('BASE_PATH'))
	exit ('Access Denied!');
return array(

	//每个地区使用的模拟ip
	'ipArea' => array(
		"北京市" => '1.2.4.7',
		"天津市" => '14.197.177.130',
		"重庆市" => '14.104.50.149',
		"上海市" => '27.109.127.255',
		"河北省" => '27.128.172.255',
		"山西省" => '1.69.127.255',
		"辽宁省" => '14.197.149.81',
		"吉林省" => '36.48.127.255',
		"黑龙江省" => '1.56.97.255',
		"江苏省" => '36.149.22.255',
		"浙江省" => '36.16.127.255',
		"安徽省" => '36.4.11.255',
		"福建省" => '1.1.7.255',
		"江西省" => '39.158.255.255',
		"山东省" => '27.192.60.255',
		"河南省" => '1.192.198.255',
		"湖北省" => '27.16.124.255',
		"湖南省" => '42.48.62.255',
		"广东省" => '1.4.127.255',
		"海南省" => '36.1.46.255',
		"四川省" => '14.196.255.255',
		"贵州省" => '1.48.44.255',
		"云南省" => '14.204.64.255',
		"陕西省" => '1.80.255.255',
		"甘肃省" => '27.224.29.255',
		"青海省" => '61.133.224.118',
		"台湾省" => '27.53.255.255',
		"内蒙古" => '1.24.7.255',
		"广西" => '43.250.247.255',
		"宁夏" => '1.50.255.255',
		"新疆" => '36.105.63.255',
		"西藏" => '27.98.234.255',
		"香港特别行政区" => '192.149.239.255',
		"澳门特别行政区" => '27.109.255.255',
	),
	//老的聚合广告类型
	'oldIntergrationType' => array(
		0 => '视频广告',
		1 => '插页广告',
		2 => '交叉推广广告',
		3 => '开屏广告',
		4 => '原生流式广告'
	),
	//上报类型，经整合后的事件类型
	'statEventtypeName' => array(
		1 => '请求配置', 2 => '请求配置成功', 3 => '下载资源', 4 => '下载资源成功', 5 => '展示(开始播放)',
		6 => '点击', 7 => '关闭(有效展示，插页的关闭，视频落地页展示)', 8 => '触发奖励(视频完整播放)', 9 => '重新观看(视频)', 10 => '跳转浏览器',
		11 => '跳转内建浏览器', 12 => '跳转商店', 13 => '跳转商店内页', 14 => 'sdk展示', 15 => '初始化',
		16 => '跳过', 18 => '退出',
		41 => '下载APP', 42 => '下载APP成功', 43 => '安装APP', 44 => '安装APP成功',
		51 => 'dsp请求', 52 => 'dsp响应', 53 => 'dsp竞价成功', 54 => 'dsp通知',
		1700 => '缓存正常', 1701 => '参数错误', 1702 => '没有缓存就绪的平台', 1703 => '无符合条件的网络环境', 1704 => '广告位展示次数上限',
		1705 => '广告位概率随机未通过', 1706 => '广告商展示次数上限',
	),
	'statVerName' =>
		array(
			1 => '聚合', 2 => 'housead', 4 => 'adx'
		),
);