<?php
if (!defined('BASE_PATH')) exit('Access Denied!');

class Common_Service_Config {

    //广告商类型
    const ADS_TYPE = array(1 => '聚合广告商', 2 => '渠道广告商', 3 => 'DSP广告商');

    //广告商类型
    const NET_TYPE = array(1 => 'unknow', 1 => 'wifi', 2 => '2G', 3 => '3G', 4 => '4G', 5 => '5G');


    //广告类型
    const PLATFORM = array(
        Common_Service_Const::ANDRIOD_PLATFORM => 'Android',
        Common_Service_Const::IOS_PLATFORM => 'IOS',
    );

    //广告类型
    const AD_TYPE = array(
        Common_Service_Const::VIDEO_ADS => '视频广告',
        Common_Service_Const::PIC_ADS => '插页广告',
        Common_Service_Const::CUSTOME_ADS => '交叉推广广告',
        Common_Service_Const::SPLASH_ADS => '开屏广告',
        Common_Service_Const::ENBED_ADS => '原生流式广告'
    );


    //用于api输出
    const AD_TYPE_NAME = array(
        Common_Service_Const::VIDEO_ADS => 'video',
        Common_Service_Const::PIC_ADS => 'pic',
        Common_Service_Const::CUSTOME_ADS => 'custome',
        Common_Service_Const::SPLASH_ADS => 'splash',
        Common_Service_Const::ENBED_ADS => 'native'
    );


    //交叉推广子类型
    const AD_SUB_TYPE = array(
        Common_Service_Const::CUSTOM_FOCUS => '精品橱窗－焦点图',
        Common_Service_Const::CUSTOM_WALL => '精品橱窗－应用墙',
        Common_Service_Const::CUSTOM_NATIVE => '原生Banner',
    );

    //监控类型
    const MONITOR_TYPE = array(
        1 => 'ecpm值',
        2 => '活跃用户',
        3 => '人均展示',
    );

    //国家区域配置
    const COUNTRY = array(
        '亚洲' => array(
            'CN' => '中国',
            'BT' => '不丹',
            'AF' => '阿富汗',
            'BD' => '孟加拉国',
            'MM' => '缅甸',
            'KH' => '柬埔寨',
            'IN' => '印度',
            'ID' => '印度尼西亚',
            'JP' => '日本',
            'LA' => '老挝',
            'MY' => '马来西亚',
            'MV' => '马尔代夫',
            'SG' => '新加坡',
            'KR' => '韩国',
            'LK' => '斯里兰卡',
            'TH' => '泰国 ',
            'TR' => '土耳其',
            'VN' => '越南',
            'BN' => '文莱',
            'PK' => '巴勒斯坦',
            'YE' => '也门'
        ),
        '欧洲' => array(
            'AL' => '阿尔巴尼亚',
            'AT' => '奥地利',
            'BE' => '比利时',
            'BG' => '保加利亚',
            'HR' => '克罗地亚',
            'CY' => '塞浦路斯',
            'DK' => '丹麦',
            'FI' => '芬兰',
            'FR' => '法国',
            'DE' => '德国',
            'GR' => '希腊',
            'HU' => '匈牙利',
            'IS' => '冰岛',
            'IE' => '爱尔兰',
            'IT' => '意大利',
            'LI' => '列支敦士登',
            'LU' => '卢森堡',
            'MK' => '马其顿',
            'MT' => '马耳他',
            'MC' => '摩纳哥',
            'NL' => '荷兰',
            'PL' => '波兰',
            'PT' => '葡萄牙',
            'RO' => '罗马尼亚',
            'RU' => '俄罗斯',
            'BY' => '白俄罗斯',
            'SI' => '斯洛文尼亚',
            'ES' => '西班牙',
            'SE' => '瑞典',
            'CH' => '瑞士',
            'GB' => '英国'
        ),
        '大洋洲' => array(
            'AU' => '澳大利亚',
            'FJ' => '斐济',
            'KI' => '基里巴斯',
            'NR' => '瑙鲁',
            'NZ' => '新西兰',
            'PG' => '巴布亚新几内亚',
            'SB' => '所罗门群岛',
            'TO' => '汤加',
            'VU' => '瓦努阿图',
            'WS' => '西萨摩亚'
        ),
        '美洲' => array(
            'AI' => '安圭拉岛',
            'AR' => '阿根廷',
            'BS' => '巴哈马',
            'BZ' => '伯利兹',
            'BM' => '百慕大群岛',
            'BO' => '玻利维亚',
            'BR' => '巴西',
            'VG' => '英属维尔京群岛',
            'CA' => '加拿大',
            'CL' => '智利',
            'CO' => '哥伦比亚',
            'CR' => '哥斯达黎加',
            'CU' => '古巴',
            'DO' => '多米尼加',
            'EC' => '厄瓜多尔',
            'SV' => '萨尔瓦多',
            'GL' => '格陵兰',
            'GD' => '格林纳达',
            'GT' => '危地马拉',
            'GY' => '圭亚那',
            'HT' => '海地',
            'HN' => '洪都拉斯',
            'JM' => '牙买加',
            'MX' => '墨西哥',
            'MS' => '蒙特塞拉特岛',
            'NI' => '尼加拉瓜',
            'PA' => '巴拿马',
            'PY' => '巴拉圭',
            'PE' => '秘鲁',
            'VC' => '圣文森特岛',
            'SR' => '苏里南',
            'TT' => '特立尼达和多巴哥',
            'US' => '美国',
            'UY' => '乌拉圭',
            'VE' => '委内瑞拉',
            'VI' => '美属维尔京群岛'
        ),
        '非洲' => array(
            'DZ' => '阿尔及利亚',
            'AO' => '安哥拉',
            'BJ' => '贝宁',
            'BW' => '博茨瓦纳',
            'BI' => '布隆迪',
            'CM' => '喀麦隆',
            'CF' => '中非',
            'TD' => '乍得',
            'CG' => '刚果共和国',
            'DJ' => '吉布提共和国',
            'EG' => '埃及',
            'GQ' => '赤道几内亚',
            'ER' => '厄立特里亚',
            'ET' => '埃塞俄比亚',
            'GA' => '加蓬',
            'GM' => '冈比亚',
            'GH' => '加纳',
            'GN' => '几内亚',
            'GW' => '几内亚比绍共和国',
            'KE' => '肯尼亚',
            'LS' => '莱索托',
            'LR' => '利比里亚',
            'LY' => '利比亚',
            'MG' => '马达加斯加',
            'MW' => '马拉维',
            'ML' => '马里',
            'MU' => '毛里求斯',
            'MR' => '毛里塔尼亚',
            'MA' => '摩洛哥',
            'MZ' => '莫桑比克',
            'NA' => '纳米比亚',
            'NE' => '尼日尔',
            'NG' => '尼日利亚',
            'CD' => '刚果民主共和国 扎伊尔',
            'RW' => '卢旺达',
            'ST' => '圣多美及普林西比民主共和国',
            'SN' => '塞内加尔',
            'SC' => '塞舌尔',
            'SO' => '索马里',
            'ZA' => '南非',
            'SD' => '苏丹',
            'SZ' => '斯威士兰',
            'TZ' => '坦桑尼亚',
            'TG' => '多哥',
            'TN' => '突尼斯',
            'UG' => '乌干达',
            'ZM' => '赞比亚',
            'ZW' => '津巴布韦'
        ),
        //			'通用'=>array(60001=>'通用' )
    );

    //全国省份
    const PROVINCE = array(
        '北京' => '北京市',
        '天津' => '天津市',
        '河北' => '河北省',
        '山西' => '山西省',
        '内蒙' => '内蒙古自治区',
        '辽宁' => '辽宁省',
        '吉林' => '吉林省',
        '黑龙' => '黑龙江省',
        '上海' => '上海市',
        '江苏' => '江苏省',
        '浙江' => '浙江省',
        '安徽' => '安徽省',
        '福建' => '福建省',
        '江西' => '江西省',
        '山东' => '山东省',
        '河南' => '河南省',
        '湖北' => '湖北省',
        '湖南' => '湖南省',
        '广东' => '广东省',
        '广西' => '广西省',
        '海南' => '海南省',
        '重庆' => '重庆市',
        '四川' => '四川省',
        '贵州' => '贵州省',
        '云南' => '云南省',
        '西藏' => '西藏自治区',
        '陕西' => '陕西省',
        '甘肃' => '甘肃省',
        '青海' => '青海省',
        '宁夏' => '宁夏自治区',
        '新疆' => '新疆自治区',
        '香港' => '香港特别行政区',
        '澳门' => '澳门特别行政区',
        '台湾' => '台湾省',
        '未知' => '未知地区'
    );


}